gsoap/bossnSoapBinding.Appeared.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
 xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://localhost/bossn">
 <SOAP-ENV:Body>
   <ns1:Appeared>
    <ns1:platformId></ns1:platformId>
   </ns1:Appeared>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
